const ru = {
  navLinks: [
    {
      label: 'Главная',
      path: '/',
    },
    {
      label: 'Автопарк',
      path: '/fleet',
    },
    {
      label: 'Магазин',
      path: '/shop',
    },
    {
      label: 'О нас',
      path: '/about-us',
    },
    {
      label: 'Страхование',
      path: '/insurance',
    },
  ],
  footer: {
    explore: 'Навигация',
    workHours: 'Наше рабочее время',
    contactUs: 'Связаться с нами',
    rights: 'Все права защищены.',
    createdBy: 'Разработчик',
    footerLinks: [
      {
        label: 'Условия использования',
        path: '/terms',
      },
      {
        label: 'Политика конфиденциальности',
        path: '/privacy-policy',
      },
      {
        label: 'Политика использования файлов cookie',
        path: '/cookie-policy',
      },
    ],
  },

  heroTitle: 'Хотите сэкономить на аренде автомобиля?',
  heroSubtitle:
    'Компания, которая предлагает лучшее качество обслуживания и удовлетворенность клиентов среди компаний по аренде автомобилей',
  stepsLabel: 'КАК ЭТО РАБОТАЕТ',
  stepsTitle: 'Rentgo следующие 3 рабочих шага',
  servicesLabel: 'ЛУЧШИЕ СЕВИЦЫ',
  servicesTitle: 'Почувствуйте себя на высоте с нашими предложениями по аренде авто',
  fleetsLabel: 'НАШИ ФЛОТЫ',
  fleetsTitle: 'Ознакомьтесь с нашей лучшей сделкой от высококлассного дилера',
  benefitsTitle: 'Мы обеспечиваем наилучшее обслуживание клиентов',
  benefitsDesc: 'Вы не можете назначить цену за безопасность вашей семьи на дороге. Нашли более низкую цену?',
  faqLabel: 'НАЙДИТЕ СВОЙ ОТВЕТ ЗДЕСЬ',
  faqTitle: 'Часто задаваемые вопросы',
}

export default ru
