const uk = {
  navLinks: [
    {
      label: 'Головна',
      path: '/',
    },
    {
      label: 'Автопарк',
      path: '/fleet',
    },
    {
      label: 'Покупка',
      path: '/shop',
    },
    {
      label: 'Про нас',
      path: '/about-us',
    },
    {
      label: 'Страхування',
      path: '/insurance',
    },
  ],
  button: {
    search: 'Пошук',
    moreVehicles: 'Більше Автомобілів',
    rentNow: 'Орендувати',
    select: 'Вибрати',
    moreInfo: 'Докладніше',
    explore: 'Дослідити',
    back: 'Назад',
    readyToBuy: 'Готові купити? Ось як це працює.',
    getStarted: 'Розпочати',
    submit: 'Надіслати',
    geTrafficInsuranceOffers: 'Отримати пропозицію по страхуванню',
    loading: 'Відправка...',
    continue: 'Продовжити',
    showResults: 'Показати результати',
    changeSearch: 'Змінити Пошук',
    acceptAll: 'Прийняти всі',
  },
  links: {
    terms: 'Правила та умови',
    clearAll: 'Очистити всі',
    readMore: 'Детальніше',
  },
  filter: {
    title: 'Фільтрувати по',
    rentCost: 'Вартість оренди (за добу)',
    carCost: 'Вартість автомобіля',
    usedCars: 'Вживані Авто',
    newCars: 'Нові Авто',
    brands: 'Марки',
    vehicleClass: 'Клас Автомобіля',
    bodyStyle: 'Тип Кузова',
    fuelType: 'Тип Палива',
    transmission: 'Трансмісія',
    mileage: 'Пробіг',
    year: 'Рік',
    exteriorColor: 'Зовнішній Колір',
    interiorColor: 'Колір Салону',
  },
  filterNav: {
    result: ['Результат', 'Результати', 'Результатів'],
    filters: 'Фільтри',
    sortBy: {
      recommended: 'Рекомендовано',
      newestInventory: 'Новітній інвентар',
      lowestPrice: 'Найнижча ціна',
      highestPrice: 'Найвища ціна',
    },
  },
  shopSingle: {
    vehicleDetails: 'Інформація про автомобіль',
    overview: 'Загальний огляд',
    features: 'Особливості',
  },
  reservation: {
    stepLabels: ['Деталі поїздки', 'Оберіть автомобіль', 'Контактні дані', 'Підсумок бронювання'],
    prepareReservation: 'Підготувати бронювання',
    rideDetails: 'Деталі поїздки',
    pickUp: 'Видача',
    dropOff: 'Повернення',
    summary: {
      title: 'Підсумок',
      daysNum: 'Кількість днів',
      rentPrice: 'Вартість оренди',
      extras: 'Додаткові послуги',
      totalAmount: 'Загальна вартість',
      vehicle: 'Автомобіль',
    },
    additionalServices: {
      title: 'Додаткові послуги',
      dailyPrice: 'Ціна за добу',
      yes: 'Так',
      no: 'Ні',
    },
    personalInformation: 'Особиста інформація',
    bookingSummary: {
      title: 'Дякуємо за замовлення!',
      desc: 'Ваше попереднє бронювання отримано. Інформація, яку ви надіслали, надійшла до нашої системи. Ви будете проінформовані по електронній пошті або по телефону, коли Ваше бронювання буде підтверджено. Ми дякуємо вам.',
      note: 'Примітка',
      noteText:
        "Якщо ви не отримали відповідь протягом 24 годин, значить ви або неправильно ввели свою адресу електронної пошти, або наші листи потрапляють у спам. Якщо дата вашого прибуття знаходиться в межах найближчих 24 годин, будь ласка, зв'яжіться з нами за вказаними нижче телефонами.",
    },
  },
  insurance: {
    tabs: {
      hasPlate: 'У мене є номерний знак',
      hasNotPlate: 'У мене немає номерного знаку',
    },
    stepLabels: ['Основна інформація', 'Інформація про автомобіль', 'Контактна інформація', 'Подання'],
    addStepLabel: 'Інформація про ліцензію',
    vehicleSelectStep: {
      title: 'Введіть інформацію про транспортний засіб',
      desc: 'Інформація про автомобіль, якою ви поділитеся, завжди буде в безпеці з Toprakcar.',
    },
    vehicleInfoStep: {
      title: 'Інформація про ліцензію',
      desc: 'Вся інформація, яку ви зберігаєте, завжди в безпеці з Toprakcar.',
      banner: {
        title: 'У вас немає з собою посвідчення?',
        fistLine: 'Ви можете отримати доступ до інформації про ліцензію через електронний уряд',
        secondLine: 'Ви можете увійти до електронного уряду, використовуючи дані користувача інтернет-банкінгу',
      },
    },
    contactInfoStep: {
      title: 'Введіть свою контактну інформацію',
      desc: 'Вся інформація, яку ви зберігаєте, завжди в безпеці з Toprakcar.',
    },
    formSubmissionStep: {
      title: 'Дякуємо, що обрали Toprakcar',
      desc: "Наші менеджери зв'яжуться з вами найближчим часом",
    },
  },
  aboutPage: {
    contacts: 'Контакти',
  },
  forms: {
    labels: {
      fullName: 'П.І.Б.',
      email: 'Електронна пошта',
      phone: 'Номер телефону',
      min: 'Мін',
      max: 'Макс',
      nationality: 'Національність',
      TCnumber: 'Ідентифікаційний номер ТС',
      passportIdNumber: 'Номер паспорта',
      additionalNote: 'Додаткова примітка',
      isTurk: 'Я громадянин Туреччини',
      notTurk: 'Я не громадянин Туреччини',
      licensePlate: 'Номерний знак',
      TRIdentity: 'TC Ідентифікація',
      brand: 'Марка',
      year: 'Рік',
      model: 'Модель',
      licenseSerial: 'Серійний номер',
      licenseNumber: 'Номер ліцензії',
    },
    placeholders: {
      chooseLocation: 'Оберіть локацію',
      pickUpLocation: 'Місце Видачі',
      dropOffLocation: 'Місце Повернення',
      pickupDate: 'Дата видачі',
      returnDate: 'Дата повернення',
      message: 'Повідомлення',
    },
    termsOfService: 'Прочитав і схвалюю',
    carPurchase: {
      title: 'Контактні дані',
      desc: "Введіть свої контактні дані і наші менеджери зв'яжуться з Вами найближчим часом",
    },
  },
  footer: {
    explore: 'Навігація',
    workHours: 'Наш графік роботи',
    contactUs: "Зв'язатися з нами",
    rights: 'Усі права захищені.',
    createdBy: 'Створено',
    footerLinks: [
      {
        label: 'Умови користування',
        path: '/terms-of-use',
      },
      {
        label: 'Політика конфіденційності',
        path: '/privacy-policy',
      },
      {
        label: 'Політика використання файлів cookie',
        path: '/cookie-policy',
      },
    ],
  },

  page404: {
    title: 'Упс! Сторінку не знайдено',
    subtitle: 'Ця сторінка не існує або була видалена',
    btn: 'На головну',
  },

  validation: {
    required: "Обов'язкове поле",
    search: {
      required: 'Оберіть деталі пошуку',
      pickUpLocation: {
        required: 'Оберіть місце видачі',
      },
      dropOffLocation: {
        required: 'Оберіть місце повернення',
      },
      pickUpDate: {
        min: 'Оберіть майбутню дату',
        required: 'Оберіть дату видачі',
      },
      dropOffDate: {
        min: 'Дата закінчення має бути після дати початку',
        required: 'Оберіть дату повернення',
      },
    },
    personalInfo: {
      fullName: {
        max: 'Максимум 20 символів',
        matches: 'Будь ласка, введіть коректне ПІБ',
      },
      idNumber: {
        incorrectTC: 'Невірний ідентифікаційний номер ТС',
        incorrectPasswordNum: 'Невірний номер паспорту',
      },
      email: {
        isEmail: 'Будь ласка, введіть дійсну електронну адресу',
      },
      phone: {
        matches: 'Будь ласка, введіть дійсний номер телефону',
      },
      message: {
        max: 'Максимум 300 символів',
      },
    },
    insurance: {
      licensePlate: {
        incorrect: 'Невірний номерний знак',
      },
      vehicleSelect: {
        min: 'Мінімальне значення 1970',
        max: 'Вкажіть коректний рік випуску',
      },
      vehicleInfo: {
        licenseSerial: {
          incorrect: 'Невірна серія ліцензії',
        },
        licenseNumber: {
          incorrect: 'Невірний номер ліцензії',
          minMax: 'Повинно бути рівно 6 цифр',
        },
      },
    },
  },

  notistack: {
    successSubmit: 'Форма успішно відправлена',
    errorSubmit: 'Сталася помилка, будь ласка, спробуйте пізніше',
  },
  dataState: {
    error: {
      title: 'Щось пішло не так.',
      subtitle: 'Зачекайте, поки ми не виправимо помилку. Ви також можете оновити сторінку або спробувати пізніше',
    },
    notFound: {
      title: 'Результатів не знайдено',
      subtitle: 'Спробуйте видалити деякі фільтри або збільшити діапазон, щоб побачити більше результатів',
    },
  },
  cookiesConsent: {
    text: `Ми використовуємо файли cookie, щоб покращити ваш досвід перегляду веб-сторінок, показувати персоналізовану рекламу або контент, а також аналізувати наш трафік. Натискаючи "Прийняти всі", ви даєте згоду на використання нами файлів cookie.`,
  },
}

export default uk
